[
    {
        "articleTitle": "Work Term Report Summer 2024",
        "slug": "Camis_term_2",
        "company": "Camis Inc",
        "jobTitle": "Data Developer - Co-Op - Term 2",
        "cardSummary": "Continuing my work from the first term I also worked to maintain & development our ELT pipeline, overhauling our SQL resiliency pipeline, creating tests and writing C# code for the Camis 5 application.",
        "introduction": "For my final two work terms as an undergraduate student here at the University of Guelph I have been working for a software development company called Camis. I have now completed two work terms at Camis and am now returning to my academic studies with the aim to complete my final year as an undergraduate student. My position at Camis was as a Data Developer Co-op, I work closely with my supervisor Josh Janicas to oversee most of our data warehousing and ELT needs, along with some software maintenance and feature development on the side. \n\n In light of the completion of my Summer 2024 work term I am writing this report to make note of my continued activities at Camis and the initiatives I participated in over the past few months.",
        "aboutTheEmployer": "Camis is a software company located in Guelph at 130 Research Ln, not too far from the university of Guelph conveniently enough, with a few other facilities scattered about Canada and the USA. Camis is a software development company that specializes in reservation and park management solutions. Camis works in partnership with over 500 national, state, provincial, county, regional parks, conservation authorities, harbors and marinas across Canada and the United States to deliver a centralized park reservation, booking, sales, and management system. \n\n Along with the development and management of their software, the current version being called Camis 5, they also operate an in house call centre that runs concurrently with and compliments the solutions they create where highly trained staff are ready and waiting to help the customers of the various parks they are in partnership with create bookings and answer questions over the phone or on a live web chat. \n\n During the summer 2024 work term we said goodbye to two of our co-op colleagues, Adina and Amro, who were only on co-op for one term. We also welcomed a new co-op student named Zoe who would be taking over in the QA role Amro previously occupied. Camis is eager to nurture the next generation of developers. Each of us worked with a different squad within the company so we never got the chance to collaborate together on any initiatives but we all still found time to talk and have some fun.",
        "goalType1": "CRITICAL & CREATIVE THINKING - Depth & Breadth of Understanding - ",
        "goal1": "I want to better understand the context that surrounds the code I work on. At the moment I am able to work on the code but outside of the files I am immediately working with everything else feels like a black box, with its functionality being mysterious.",
        "goalActionPlan1": "Get more comfortable with the codebase, work on more projects and over time the gaps in my knowledge should shrink.",
        "goalReflection1": "My overall knowledge of the system has vastly improved over the last four month of this coop. I am now able to do tickets or increased difficulty without as much or any help.",
        "goalType2": "LITERACY - Technological Literacy - ",
        "goal2": "Understand more of the intricacies of C#, SQL, and snowflake. I can now write SQL, C# code and work with snowflake but I am still incredibly novice I want to improve so that I can work more quickly and effectively.z",
        "goalActionPlan2": "Continue on the trajectory I have, working on tickets and asking questions when necessary, and over time I should improve.",
        "goalReflection2": "I am now much faster at my work and can complete something that would have previously taken me a few days in a few hours or day.",
        "goalType3": "CRITICAL & CREATIVE THINKING - Problem Solving - ",
        "goal3": "I want to get to a point where I am comfortable issuing my own tasks and not waiting to be assigned them by my supervisor. I want to become confident enough that I am able to just pick problems out of our backlog and work on them myself.",
        "goalActionPlan3": "Hone my skills to a point where maintenance tickets, even those not given extra attention to make them easier for me, doable on my own.",
        "goalReflection3": "Due to the nature of the work I was doing it was rare that I got the opportunity to create my own tasks as the backlog of work was already defined for the things that needed to be done, so I did not get the chance to make my own tickets. But I did get to a point where I would find issues in existing tickets I was assigned and was able to correct them or add additional tasks.",
        "goalType4": "",
        "goal4": "",
        "goalActionPlan4": "",
        "goalReflection4": "",
        "goalType5": "",
        "goal5": "",
        "goalActionPlan5": "",
        "goalReflection5": "",
        "jobDesctiption": "As previously mentions my position here at Camis is as a Data Developer Co-op. I work as part of a team consisting of around 8 people called the 'Core Squad' within this team I work almost exclusively with my supervisor, although on rare occasion I get recruited to help with other initiatives. I was hired to help mainly with the migration, and restructuring of our data warehouse to the cloud. \n\n much of my early work was to learn all about the context I was to be working in, familiarizing myself with the repositories, existing data, our ticketing system, and learning how to actually program in C# and SQL; The two most important skills I would need for my job. When I started I had never touched either of these languages and it took a while to begin to comprehend how they worked and what it was I would be doing.  \n\n  Now after eight months and having completed my time there I can finally say I am knowledgeable and know what I am doing. It took me the first four months to get adjusted and integrate myself into the environment. I felt that I only truly began to put all the pieces together around month six. Before that I had an idea of what I was doing but my understanding was fragmented and there was no connection or cohesion between the different parts I understood. After month six the pieces had finally all snapped into place and I had my moment of understanding that made everything clear.  \n\n  At Camis we use Jira to manage our workflows and development. Much of my work here relates to maintenance or development of our ELT pipeline. The new data warehouse solution we are moving to is tens of times faster than our old in house solution. A refresh of a database for one of Camis's larger clients used to take days to run to completion, now it can be done in a matter of minutes. \n\n Since starting here I have participated in several initiatives such as the maintenance of our SQL database, completely overhauling our SQL resiliency pipeline across hundreds of files, performing updates to our existing solutions, creating tests for new or refactored existing methods and classes, the ongoing creation of a new ELT pipeline, creating a new automated process to transition new clients onto our Camis 5 software, post-deploy scripts, and much more. \n\n As part of the Core Squad we do not have sprint cycles the way many other teams do, for us as we are working with the databases and the manipulation of data, it is extremely important that we do not rush things and ensure that everything we do is without error and will not cause issue if it were to be released to the parks that rely on our software. Pushing a change that then accidentally corrupts or leaks a database would be catastrophic. Because of this we work on a its 'done when its done' basis. Tickets are taken or assigned when ongoing tickets are completed and there is no crunch to ensure features are complete in time for a tight deadline. There is of course goals that we would like to include X feature for X release version however this is not a hard set rule and things are moved around as deemed necessary.",
        "conclusion": "My time here has felt so short, as if it has passed in the blink of an eye, each day brings a new challenge and a chance to learn something new. This is the first co-op position where I got to work on actual code, and work with repositories and it has been a blast to take a step into the field I will hope to embark into once I graduate. This position has been such an amazing learning opportunity for me and I feel so incredibly lucky that I got to work in such a great environment with tons of awesome people. I have learned so much that school has might never have taught me and the skill I have acquired will certainly help me later in life no matter where I end up. I hope my Work Term Report has shed some light on my placement and the role I play within Camis. \n\n In my last report I closed it out by mentioning that I had another four month to complete and that the second term is where you truly learn a lot. In reflecting on that now I still agree with my outlook from four months ago. I truly found my place and understanding in the second work term in a way that just isn't possible to do in one work term. \n\n To anyone who made it all the way to the end, thank you for taking the time to read my Summer 2024 co-op work term report.",
        "acknowledgements": "I want to extend another extra special thank you to Josh Janicas, my supervisor, for his incredible guidance and mentoring over these past eight months. When first hired for this position I was honestly surprised as I felt I was incredibly unqualified and had expressed my lack of knowledge in regards to SQL and other aspects of the job during the interview. Despite this I was hired and treated incredibly well by my team and supervisor. Josh was always available to answer my questions in times of need and helped me throughout the entire work term. It was amazing to work alongside such a supportive senior developer, I feel as though my time at Camis truly taught me more than any University course ever did.  I went from having never worked with most of the languages required for the roll, including SQL, snowflake, and C#, to feeling competent and capable of tackling anything that was assigned to me. For his incredible guidance I am incredibly grateful.",
        "cardImg": "images/Camis_Logo.png",
        "cardImgAlt": "Camis Inc Logo",
        "articleImg1": "/images/Camis_Olympics.avif",
        "articleImg1Alt": "Failed to Load Camis Olympics Results",
        "articleImg1Desc": "The Summer 2024 Camis Co-ops who posing for a photo after winning the team tent speed building event held for the Camis Olympics team building day. \n\n From left to right: Jen, Ben T (me), Ben C, and Joudat",
        "articleImg2": "/images/Camis_Logo_Long.png",
        "articleImg2Alt": "Failed to Load Camis Logo",
        "articleImg2Desc": ""
    },
    {
        "articleTitle": "Work Term Report Winter 2024",
        "slug": "Camis_term_1",
        "company": "Camis Inc",
        "jobTitle": "Data Developer - Co-Op - Term 1",
        "cardSummary": "I worked to, among other things, migrate and restructure Camis's data warehouse to a new cloud based architecture improving speed and scalability.",
        "introduction": "For my final two work terms during my time as an undergraduate student here at the university of Guelph I am working for a software company called Camis. I have worked here for just over four months now, starting in January, and have completed the first of the two terms of my employment. My position here at Camis is as a Data Developer Co-op, I work closely with my supervisor Josh Janicas to oversee most of our data warehousing and transformation needs. \n\n In light of the completion of my winter 2024 work term I am writing this report to make note of my activities at Camis and the initiatives I have been a part of thus far.",
        "aboutTheEmployer": "Camis is a software company located in Guelph at 130 Research Ln, not too far from the university of Guelph conveniently enough, with a few other facilities scattered about Canada and the USA. Camis is a software development company that specializes in reservation and park management solutions. Camis works in partnership with over 500 national, state, provincial, county, regional parks, conservation authorities, harbors and marinas across Canada and the United States to deliver a centralized park reservation, booking, sales, and management system.  \n\n Along with the development and management of their software, the current version being called Camis 5, they also operate an in house call centre that runs concurrently with and compliments the solutions they create where highly trained staff are ready and waiting to help the customers of the various parks they are in partnership with create bookings and answer questions over the phone or on a live web chat. \n\n During the winter 2024 work term Camis hired six co-op students. Camis is very eager to nurture the next generation of developers. Each of us worked for a different squad within the company so we don't ever get a chance to work together but we all still find time to talk and have some fun.",
        "goalType1": "LITERACY - Technological Literacy - ",
        "goal1": "I want to learn more about the programming language SQL as I will be working with it quite a lot at this placement and going into this coop I have very limited exposure to it.",
        "goalActionPlan1": "Follow the guide that was provided to me by my supervisor and do research on my own throughout my coop to learn more and understand how SQL works.",
        "goalReflection1": "I still have a lot of room to improve, however I do feel that I am now much more competent than I was 4 months ago with reading and writing SQL code.",
        "goalType2": "PROFESSIONAL & ETHICAL BEHAVIOUR - Teamwork - ",
        "goal2": "Understand the inner workings of the Camis teams. There are quite a few teams performing different tasks that I do not interact with on a regular basis. I want to get to know what the various departments are and those that work in them.",
        "goalActionPlan2": "Familiarize myself with the office environment, work with others, and interact with those around me in the office to build connections and create a sense of comradery and teamwork.",
        "goalReflection2": "I have made connections with most of the other coops students that are also placed at Camis and some full time employees but a lot of the teams here at Camis do not work together simply because our work does not overlap and so we don't interact.",
        "goalType3": "CRITICAL & CREATIVE THINKING - Depth & Breadth of Understanding - ",
        "goal3": "Camis is the first development position I have held and they have a lot of internal information that you need to know in order to work efficiently and in sync with the other teams. There is so much that I am being introduced to in my first week and it can be overwhelming. I hope I will come to be familiar with the technologies we are developing and how to interface with them.",
        "goalActionPlan3": "Read through articles that are published on the Camis internal wiki sites to gain an understanding of the various aspects, talk to my supervisor and other team members about things that are confusing or are otherwise new to me. Be a sponge and absorb as much information as I can.",
        "goalReflection3": "I still need to improve in this department. When I sit in on stand up meetings there are lots of more complicated tasks that are discussed that I do not understand and cannot contribute to the discussion about.",
        "goalType4": "PROFESSIONAL & ETHICAL BEHAVIOUR - Personal Organization/Time Management - ",
        "goal4": "Effectively manage myself in a work from home environment as it can be easy to be unproductive when there are no supervisors present and you are in the comfort of your own home, where for example you may not have a dedicated work space.",
        "goalActionPlan4": "Wake up at the same time I would as if I was going into work, make my bed, and get dressed as if I was going into work. Having my workstation (desk) clear of distractions and using timers to ensure I stay on task for a set amount of time without distraction.",
        "goalReflection4": "I am improving at self regulation and staying on task at home and in the office.",
        "goalType5": "PROFESSIONAL & ETHICAL BEHAVIOUR - Personal Organization/Time Management - ",
        "goal5": "Effectively manage my ADHD while working both at home and in the office. It can be difficult for me to concentrate and thus I get distracted and doodle or stare off into space a lot. I want to better carry myself in a way where this does not happen as often and the effect on my work is minimized.",
        "goalActionPlan5": "Purchase a fidget toy to have something to help me maintain engagement during meetings and presentations. take breaks to stretch my legs every so often, do not sit all day (use the standing desk functionality), make goals or task to accomplish throughout the day. keep a notebook on me that I can write things down in that I will likely not remember.",
        "goalReflection5": "I find myself looking off into space less than before and I am better able to focus on work for prolonged periods of time.",
        "jobDesctiption": "As previously mentions my position here at Camis is as a Data Developer Co-op. I work as part of a team consisting of around 8 people called the 'Core Squad' within this team I work almost exclusively with my supervisor.  I was hired to help mainly with the migration, and restructuring of our data warehouse to the cloud. \n\n much of my early work was to learn all about the context I was to be working in, familiarizing myself with the repositories, our ticketing system, and learning how to actually program in C# and SQL; The two most important skills I would need for my job. When I started I had never touched either of these languages and it took a while to begin to comprehend how they worked and what it was I would be doing. To be honest I am still no expert even 4 month later, I feel as though it has taken to this point for me to finally become adjusted to the work and be able to work somewhat quickly and efficiently on my own. \n\n Here at Camis we use Jira to manage our workflows and development. Much of my work here relates to maintenance or development of our ELT pipeline. \n\n Since starting here I have participated in several initiatives such as the maintenance of our SQL database, completely overhauling our SQL resiliency pipeline across hundreds of files, performing updates to our existing solutions, creating tests for new or refactored methods and classes, the ongoing creation of a new ELT pipeline, creating a new automated process to transition new clients onto our Camis 5 software, and more. \n\n As part of the Core Squad we do not have sprint cycles the way many other teams do, for us as we are working with the databases and the manipulation of data, it is extremely important that we do not rush things and ensure that everything we do is without error and will not cause issue if it were to be released to the parks that rely on our software. Pushing a change that then accidentally corrupts or leaks a database would be catastrophic. Because of this we work on a its 'done when its done' basis. Tickets are taken or assigned when ongoing tickets are completed and there is no crunch to ensure features are complete in time for a tight deadline. There is of course goals that we would like to include X feature for X release version however this is not a hard set rule and things are moved around as deemed necessary.",
        "conclusion": "My time here feels so short, as if it has passed in the blink of an eye, each day brings a new challenge and a chance to learn something new. This is the first co-op position where I got to do actual coding, and work with repositories and it has been a blast to take a step into the field I will likely embark into once I graduate. The skills I have gained so far will certainly help me later in life no matter where I end up. I hope my Work Term Report has shed some light on my placement and the role I play within Camis. \n\n In closing I just want to mention that I still have another four months to complete at this placement and much more to learn. In my experience having an eight month work term is superior to four months as myself and many of the other coop students I have spoken to all agree that really the first four months are required to really get your feet on the ground. The second term is where things really begin to pick up. I look forward to the upcoming semester and the upcoming work that I will get to be a part of. \n\n To anyone who made it all the way to the end, thank you for taking the time to read my Winter 2024 co-op work term report.",
        "acknowledgements": "I want to extend a special thank you to Josh Janicas, my supervisor, for his incredible guidance and mentoring over these past few months. When I was hired for this position I was certainly underqualified for the job and was frankly surprised that I got it. Despite this fact I was still  brought aboard and given a tremendous amount of help and support through guides and walkthroughs on how to work with SQL, snowflake, Meltano, the ELT pipeline, C# and much more created by Josh to help get me up to speed. Along with this for any new assignment I was unfamiliar with he would work with and shadow me as I worked to ensure I understood what I was doing and correct any mistakes I might have been making. He has been very supportive of me and encourages me to try new things and to look at this co-op as a learning opportunity",
        "cardImg": "images/Camis_Logo.png",
        "cardImgAlt": "Camis Inc Logo",
        "articleImg1": "images/Camis_Coops.png",
        "articleImg1Alt": "Failed to Load Camis 2024 co-op cohort",
        "articleImg1Desc": "Photo taken from the Camis LinkedIn page: \n The Winter 2024 Camis Co-ops Posing for a photo a few days after stating at the company. \n From left to right: Ben T (me), Jen, Ben C, Adina, Joudat, Amro",
        "articleImg2": "images/Camis_Logo_Long.png",
        "articleImg2Alt": "Failed to Load Camis Logo",
        "articleImg2Desc": ""
    },
    {
        "articleTitle": "Work Term Report Summer 2023",
        "slug": "Program_Management_Office-UoG",
        "company": "Program Management Office - UoG",
        "jobTitle": "PMO Coordinator & Website Developer",
        "cardSummary": "I was tasked with revamping the PM Office's online presence, overhauling their websites and creating new ones.",
        "introduction": "My third co-op work term was a placement at the University of Guelph, with the IT Program Management Office (PMO). My role in this team was PMO Coordinator & Website Developer. This position ran from May 2023 to the beginning of September 2023, and over the course of my work term, I was tasked with building the team websites for both internal and external use. \n\n The purpose of this report is to provide a summary of my goals, my responsibilities, and my experience in this role.",
        "aboutTheEmployer": "I was hired by the University of Guelph’s IT Program Management Office (PMO). The IT Program Management Office (PMO) supports the Chief Information Officer (CIO) and the U of G IT Governance Council (ITGC) by providing greater oversight across all IT projects in progress at the university. By doing so, it allows for greater visibility, more strategic decision-making, and reduced duplication of effort. \n\n The PMO also helps to set and maintain standards and guidelines for project management on campus. \n - program and project selection \n - assisting with resource management \n - providing guidance for delivering sound IT programs \n - University-wide project management \n - supporting project risk identification and management \n - project change management through reporting and assessment \n - business analysis \n\nThe PMO is a fairly small team, consisting of around 10 individuals with various backgrounds working together in a Scrumban environment to manage, support, and develop the university's past, present, and future IT projects. I selected this opportunity so that I could work in an environment I was familiar with while also continuing to branch out from the department where I had my first co-op placement last summer.",
        "goalType1": "CRITICAL & CREATIVE THINKING - Creativity - ",
        "goal1": "Plan, create, and launch a new website for the PMO team at the University of Guelph, integrating assets and elements from the current website along with the creation of new facets for the updated website.",
        "goalActionPlan1": "Gather the requirements for the new site, plan out how and when these requirements will be worked on, and execute on the work, building the elements that will make up the new site one at a time while also updating and porting over information from the current site. Review the elements and assets that have been created, put the parts together, and finally launch the new site.",
        "goalReflection1": "Looking back at this goal, I can say that it was almost a complete success. The four websites that I created during my work term were not quite ready for release by the end of my last day, with a few small areas needing additional content. However, I was able to successfully gather requirements, create a plan of action, and execute on that plan to create the sites, and at the end of my term, they were presented to my team and approved.",
        "goalType2": "LITERACY - Information Literacy - ",
        "goal2": "Learn how to use the project frameworks Kanban and Scrum (Scrumban) to gather requirements, create tasks, plan, and execute work in a timely manner while also being open in communication about the work that I am doing and being willing to ask for help when necessary.",
        "goalActionPlan2": "Read the documentation for the two frameworks, watch instructional videos on how a team can put these principles into practice, ask questions to peers, and explore their facets on my own.",
        "goalReflection2": "When I started this position, my team was using scrum, but about a month in, we added in Kanban as well, becoming a Scrumban team. While I did learn a lot about these methodologies by reading their documentation, watching instructional videos, and attending seminars and focus groups based around these methodologies there is still much more that I feel I need to learn. While I may not be an expert and have more I can improve on, I believe that with what I did learn, I was able to accomplish my goal.",
        "goalType3": "CRITICAL & CREATIVE THINKING - Depth & Breadth of Understanding - ",
        "goal3": "Learn to manage my work and communicate it to the rest of the PMO team using the project management software Azure Dev Ops.",
        "goalActionPlan3": "Learn to create my own tasks, move work items along the boards, request input and approval from supervisors, self-manage, and effectively complete my work.",
        "goalReflection3": "Azure DevOps played a critical role within my team. It was used to create, assign, record, update, and manage work within the team. By the end of my term, I was able to use the software to manage my own work in our backlog as well as interact with the rest of my team through our shared project work boards.",
        "goalType4": "PERSONAL LEARNING GOAL - ",
        "goal4": "Learn how to effectively manage ADHD in the workplace so that I can be more productive and less distracted.",
        "goalActionPlan4": "Listen to music to stay focused; keep a pad of paper at my desk so that I have something to focus my attention on when I am performing less engaging tasks, such as listening in a meeting, so that I can remain an active listener even when not engaged; and purchase a fidget toy to keep my hands occupied. Get up and stretch every once in a while, and try not to space out.",
        "goalReflection4": "This is the goal I had the most difficulty with. I found that only a few select things were able to help keep my focus on task. These things included using a standing desk as it kept me more awake and attentive, or having other members of my team present and working, thus inspiring me to work harder as well. My most surprising finding was that I actually seemed to work better when I did not wear headphones to listen to music or other sounds. I found that I was most productive when I just had the silence of the office. All around, it was enlightening to learn these things about myself and how I best work in an office environment.",
        "goalType5": "",
        "goal5": "",
        "goalActionPlan5": "",
        "goalReflection5": "",
        "jobDesctiption": "My job, as previously mentioned, was PMO Coordinator & Website Developer. In this role, I was charged with creating a series of four new websites that would be hosted internally on the University of Guelph's intranet, along with all the content that would be on them. These included a hub site for all program management office needs that connected all the others, a business analysis site, a change management site, and a project management site. Additionally, it was also my responsibility to create a new, outward-facing site that people could visit to learn about who we were and what services we could provide. There was an existing external website (Link will stop working once it is depreciated) that was used as a reference and much of it contents were either used or adapted for the new sites however it was older and much of its contents needed revision. \n\nFor these sites, I was in charge of all aspects, including gathering requirements, site planning, creating content, page layout, and graphic design. I worked together with many of the other team members with expertise in each of the areas mentioned above to create sites that were both easy to use and contained relevant information that would help University of Guelph members. By the end of my term, all the sites and other aspects had been completed, pending some final content to be provided by other team members that was to be included, and the sites should be up and running soon. \n\nOutside of these sites, my duties also included creating documentation, creating new forms or reworking old ones, creating automated cloud flows, aiding other team members in their tasks, and more. \n\nAll our work was tracked using a program called Azure DevOps. It was used to create, assign, record, update, and manage work within the team. It played a critical role in the operation of our team. Early on, tasks were created for and assigned to me, but after a few weeks, I was fully trained on how to use the software, and for the remainder of my time, I was in charge of my own workflow. \n\nWe would work in two-week sprint cycles, hold stand-ups, work replenishment meetings, sprint reviews, and other such meetings to ensure that the whole team knew what was being worked on and what needed to be prioritized. Team members had roles such as project manager, product owner, etc. in accordance with the Scrum methodology.",
        "conclusion": "I hope my Work Term report has shed a light on my placement and the role I played within PMO. I am happy that this job was my first experience in a position where project work with a deadline took centre stage. It has given me a new set of skills that I can now carry forward to my last two co-op terms and beyond. In conclusion the experience and people I worked with at the PMO really made my summer a blast that went by in the blink of an eye and I am looking forward to what the future holds. \n\nThank you for taking the time to read my Summer 2023 co-op work term report.",
        "acknowledgements": "I would like to take a moment to thank my supervisor, Vinod Varughese, and the rest of the PMO team for being such an open and welcoming team. The team has been very inviting, open, and helpful since day one, and I appreciate all their combined efforts in helping me get oriented early on and ever since with the various tasks, trials, and tribulations over my time working there.",
        "cardImg": "images/Guelph_Logo_Stacked.png",
        "cardImgAlt": "Failed to Load University of Guelph Logo",
        "articleImg1": "../images/PMO_Team.png",
        "articleImg1Alt": "The PMO Team pictured together outdoors",
        "articleImg1Desc": "Our team pictured on Deborah's (far left) farm property for an awesome team building activity day. \nFrom left to right: Deb, Jaymin, Vinod (Supervisor), Agatha, David, Alex (PMO Manager), Ben (Me), Pansy",
        "articleImg2": "../images/PMO_Logo.avif",
        "articleImg2Alt": "The PMO Team's Logo",
        "articleImg2Desc": ""
    },
    {
        "articleTitle": "Work Term Report Summer & Fall 2022",
        "slug": "Computing_and_Communication_Services-UoG",
        "company": "CCS IT Help Center - UoG",
        "jobTitle": "Student IT Consultant",
        "cardSummary": "As Part of a small team of both full time co-ops and part time student staff provided IT support to all of UoG both in person and online.",
        "introduction": "For my first two work terms, 8 months total, I worked as a Student IT Consultant for the University of Guelph’s Computing and Communication Services (CCS) department. My work term began May 2022, and concluded towards the end of December 2022. The purpose of this report is to shed light on my goals, my responsibilities, and the difficulties we faced during the busiest and most hectic 4 months that CCS has experienced in the past 10 years.",
        "aboutTheEmployer": "I was Hired by the University of Guelph’s Computing and Communication Services department (CCS). CCS is a department within the University that is tasked with all IT and computing related services. Ranging from campus business phones, networking,  virus and threat protection, account management, and more. They provide support to all associated with the University of Guelph, Guelph-Humber and Ridgetown College. \n\n Within CCS I was working for the IT Help Centre. The Help Centre functions as a first point of contact between clients and the CCS department. They provide assistance to the best of their ability with any issue that clients bring to them. Some common issues resolved by the Help Centre are password resets, general account issues, Microsoft office issues, Zoom or Teams support, virus and threat protection, managing scam and phishing attempts, and more. They offer best effort support on any issue brought to them and if it is not something They themselves are equipped to deal with they also work as a central hub that can then escalate issues to other branches of CCS specialized to handle more complex/specific issues. Clients are able to contact a student IT representative via email, phone, or in-person at the IT Help Desk located just inside the front entrance to the University’s campus library. \n\n I selected this opportunity to learn more about the University I am attending and to network with others attending or working for the University of Guelph as well.",
        "goalType1": "TERM 1: CRITICAL & CREATIVE THINKING - ",
        "goal1": "Over the course of my COOP I want to learn more about the applications and websites used at the University of Guelph so that I will be better prepared to help clients when I am approached with a problem that I have never encountered before.",
        "goalActionPlan1": "Read through the documentation we have for supporting applications such as for Teams, Outlook, etc. Additionally I plan to try using these applications and services myself to better understand what the end user would experience when using them.",
        "goalReflection1": "By the end of my first four months working with the University I have vastly extended the breadth of my knowledge and am now equipped to handle a large variety of issues. For those issues I have not encountered before I am confident in my ability to assist the user navigate and solve them.",
        "goalType2": "TERM 1: PROFESSIONAL & ETHICAL BEHAVIOUR - ",
        "goal2": "Get to know and understand how our departments fits into the inner working of the University of Guelph, how we collaborate with the other departments such as Managed Desktops, and how we all work together as a team to support the students and staff's activities while here.",
        "goalActionPlan2": "I will know I have been successful when I am comfortable and familiar with talking to and collaborating with the other members of my team and the other teams under the CCS umbrella.",
        "goalReflection2": "Within our team we have greatly improved our own teamwork and comradery. Additionally, outside our team I have made connection with many of the other departments under CCS and am now more familiar with what they do.",
        "goalType3": "TERM 2: PROFESSIONAL & ETHICAL BEHAVIOUR - ",
        "goal3": "With my first four months done and under my belt I would like to take on more responsibility by assuming more of a  teaching and leading role within the Help Centre team helping out other student staff to understand and improve their own abilities.",
        "goalActionPlan3": "Offer and be available for other student staff members to answer questions, clarify situations, best practices and other helpful support or information when situations or problems are unclear.",
        "goalReflection3": "I can now confidently say that I have improved at directing and aiding other student staff and COOPs with tough or confusing inquiries or situations when they have questions.",
        "goalType4": "TERM 2: CRITICAL & CREATIVE THINKING - ",
        "goal4": "At CCS every new week is a new adventure into unfamiliar waters that we can only navigate through trial and error. I would Like to learn more so I can better help the end users efficiently.",
        "goalActionPlan4": "I will continue to expand my knowledge base and create further connections within the team and other CCS teams in order to facilitate learning and communication throughout the network.",
        "goalReflection4": "Throughout the 8 months of my coop I have met others on many of the other branches of CCS and now know who to contact about different issues.",
        "goalType5": "TERM 2: COMMUNICATING - Oral Communication - ",
        "goal5": "Expand on my customer service skills.",
        "goalActionPlan5": "Through interaction with the end user, over the phone and in person at the IT Help Desk in the library gain knowledge and understanding of how best to communicate with the end user while also maintaining the confidentiality that is required by this job.",
        "goalReflection5": "I am now able to resolve almost all inquiries that I come across and if I am unable to then I can direct the clients to where they need to go in order to get their inquiries looked after.",
        "jobDesctiption": "While working for CCS my responsibilities as a Student IT Consultant revolved around assisting clients with any issues they were facing. In person while working at the IT Help desk in the University’s library, in our main office in Johnston Hall by phone, and by email. During my time working here I have resolved or assisted in the resolution of over 2000 requests and issues. Every day we are faced with new problems as the university moves through the semesters and the requests change, oftentimes we would get calls or emails about issues we had never seen before but over time we became more accustomed to the unpredictable nature of the job. In my second work term, the last 4 months, there was a cyber attack on the university that drastically affected many of our systems. It took over a week to get our systems operational once again and the lasting effects of the attack could be felt for the remainder of the semester. Due to the nature of the incident there were many issues that stemmed from it that led to CCS being extremely busy for the remainder of the time I was working there. Only a week or two before the end of my COOP term did we get things back to an average level of support requests and incoming issues finally calmed down to a point that was considered normal for that time of year. In discussions with my supervisor we, the coop team, were told that we had navigated and supported the University through the most complex and hectic period that CCS had experienced in the past 10 years or more. \n\n Outside of assisting clients we were also charged with writing and updating documentation for our web pages, and applications. Occasionally assisting in the deployment of new equipment or devices and finally, we were also in charge of the University’s phone switchboard where any caller to the university looking to connect with a specific department or individual would be sent to us to then pass along to the correct location. \n\n This job required extensive knowledge of the university and many applications that are commonly used by staff, faculty, and students who attend it. Microsoft office, web design, networking knowledge, advanced troubleshooting and knowledge of multiple operating systems, etc... A large portion of these skills were learnt during my placement over the course of the first few months. \n\n Outside of technical knowledge It also requires many soft skills required by customer service jobs. While working for CCS I was given the opportunity to vastly increase my people and communication skills, along with time management, self discipline and moderation as quite often we were too busy to work together to resolve issues.",
        "conclusion": "I hope my Work Term report has shed a light on my placement and the role I played within CCS. I am glad that I was able to experience this as my first co-op placement. It has given me a solid foundation of many transferable skills that will remain relevant for the rest of my professional career while simultaneously helping me understand and build connections at the institution I attend. Overall, the experience and people I worked with at the Help Centre really made my first two work terms a blast and I am looking forward to what the future holds. Thank you for taking the time to read my Summer 2022 and Fall 2022 coop work term report.",
        "acknowledgements": "I would Like to take a moment to thank my supervisor Jill Hogg for presenting me with the opportunity to work in this dynamic and ever changing field alongside herself, the other teams in CCS, and my fellow coop students. She was a great teacher, always willing to take a moment and provide guidance about how to best approach an IT issue that I had not worked with before, give advice on how to correct any mistakes, checking in with us coop students on a regular basis to see how we were doing and if we had any questions or concerns, and really making us all feel included and like integral parts of the Help Centre team. \n\n I would also like to thank my fellow co-op students and friends, Victoria, Connor, Gavin, Mehtab, and Yihao who worked alongside me for either four or eight months, depending on their own co-op work term schedules, while we all navigated the busiest and most hectic semester the Help Centre has seen in the past ten years. They really made the whole experience much more enriching as we collaborated together to provide the best support we could. A team can only be as strong as its weakest link and our team worked together to make sure that everyone was comfortable and knowledgeable on the many issues we face so that we could all tackle them with confidence. When there was an issue that we did not know we would work together to find solutions.",
        "cardImg": "images/Guelph_Logo_Stacked.png",
        "cardImgAlt": "Failed to Load University of Guelph Logo",
        "articleImg1": "images/CCS_Team_Fall_2022.avif",
        "articleImg1Alt": "Me and my second work term co-op student cohort standing in the UoG Library",
        "articleImg1Desc": "Our Team Pictured in front of our IT Help Desk In the University library. \n From left to right: Connor, Mehtab, Sam, Yihao,  Ben (Me), Jill (supervisor)",
        "articleImg2": "images/CCS_Logo.avif",
        "articleImg2Alt": "The CCS Department Logo",
        "articleImg2Desc": ""
    }
]