[
    {
        "articleTitle": "Work Term Report Summer 2024",
        "slug": "Camis-term-2",
        "company": "Camis Inc",
        "jobTitle": "Data Developer - Co-Op - Term 2",
        "cardSummary": "Continuing my work from the first term I also worked to maintain & development our ELT pipeline, overhauling our SQL resiliency pipeline, creating tests and writing C# code for the Camis 5 application",
        "introduction": "For my final two work terms as an undergraduate student here at the University of Guelph I have been working for a software development company called Camis. I have now completed two work terms at Camis and am now returning to my academic studies with the aim to complete my final year as an undergraduate student. My position at Camis was as a Data Developer Co-op, I work closely with my supervisor Josh Janicas to oversee most of our data warehousing and ELT needs, along with some software maintenance and feature development on the side. \n\n In light of the completion of my Summer 2024 work term I am writing this report to make note of my continued activities at Camis and the initiatives I participated in over the past few months.",
        "aboutTheEmployer": "Camis is a software company located in Guelph at 130 Research Ln, not too far from the university of Guelph conveniently enough, with a few other facilities scattered about Canada and the USA. Camis is a software development company that specializes in reservation and park management solutions. Camis works in partnership with over 500 national, state, provincial, county, regional parks, conservation authorities, harbors and marinas across Canada and the United States to deliver a centralized park reservation, booking, sales, and management system. \n\n Along with the development and management of their software, the current version being called Camis 5, they also operate an in house call centre that runs concurrently with and compliments the solutions they create where highly trained staff are ready and waiting to help the customers of the various parks they are in partnership with create bookings and answer questions over the phone or on a live web chat. \n\n During the summer 2024 work term we said goodbye to two of our co-op colleagues, Adina and Amro, who were only on co-op for one term. We also welcomed a new co-op student named Zoe who would be taking over in the QA role Amro previously occupied. Camis is eager to nurture the next generation of developers. Each of us worked with a different squad within the company so we never got the chance to collaborate together on any initiatives but we all still found time to talk and have some fun.",
        "goals": "H",
        "jobDesctiption": "I",
        "conclusion": "J",
        "acknowledgements": "K",
        "cardImg": "images/Camis_Logo.png",
        "cardImgAlt": "Camis Inc Logo",
        "articleImg1": "M",
        "articleImg1Alt": "Failed to Load Img 1",
        "articleImg1Desc": "P",
        "articleImg2": "Q",
        "articleImg2Alt": "Failed to Load Img 2",
        "articleImg2Desc": "S"
    },
    {
        "articleTitle": "Work Term Report Winter 2024",
        "slug": "Camis-term-1",
        "company": "Camis Inc",
        "jobTitle": "Data Developer - Co-Op - Term 1",
        "cardSummary": "I worked to, among other things, migrate and restructure Camis's data warehouse to a new cloud based architecture improving speed and scalability.",
        "introduction": "F",
        "aboutTheEmployer": "G",
        "goals": "H",
        "jobDesctiption": "I",
        "conclusion": "J",
        "acknowledgements": "K",
        "cardImg": "images/Camis_Logo.png",
        "cardImgAlt": "Camis Inc Logo",
        "articleImg1": "N",
        "articleImg1Alt": "Failed to Load Img 1",
        "articleImg1Desc": "P",
        "articleImg2": "Q",
        "articleImg2Alt": "Failed to Load Img 2",
        "articleImg2Desc": "S"
    },
    {
        "articleTitle": "Work Term Report Summer 2023",
        "slug": "Program-Management-Office-UOG",
        "company": "Program Management Office - UoG",
        "jobTitle": "PMO Coordinator & Website Developer",
        "cardSummary": "I was tasked with revamping the PM Office's online presence, overhauling their websites and creating new ones.",
        "introduction": "My third co-op work term was a placement at the University of Guelph, with the IT Program Management Office (PMO). My role in this team was PMO Coordinator & Website Developer. This position ran from May 2023 to the beginning of September 2023, and over the course of my work term, I was tasked with building the team websites for both internal and external use. \n\n The purpose of this report is to provide a summary of my goals, my responsibilities, and my experience in this role.",
        "aboutTheEmployer": "I was hired by the University of Guelph’s IT Program Management Office (PMO). The IT Program Management Office (PMO) supports the Chief Information Officer (CIO) and the U of G IT Governance Council (ITGC) by providing greater oversight across all IT projects in progress at the university. By doing so, it allows for greater visibility, more strategic decision-making, and reduced duplication of effort. \n\n The PMO also helps to set and maintain standards and guidelines for project management on campus. \n program and project selection \nassisting with resource management \nproviding guidance for delivering sound IT programs \nUniversity-wide project management \nsupporting project risk identification and management \nproject change management through reporting and assessment \nbusiness analysis \n\nThe PMO is a fairly small team, consisting of around 10 individuals with various backgrounds working together in a Scrumban environment to manage, support, and develop the university's past, present, and future IT projects. I selected this opportunity so that I could work in an environment I was familiar with while also continuing to branch out from the department where I had my first co-op placement last summer.",
        "goals": "H",
        "jobDesctiption": "My job, as previously mentioned, was PMO Coordinator & Website Developer. In this role, I was charged with creating a series of four new websites that would be hosted internally on the University of Guelph's intranet, along with all the content that would be on them. These included a hub site for all program management office needs that connected all the others, a business analysis site, a change management site, and a project management site. Additionally, it was also my responsibility to create a new, outward-facing site that people could visit to learn about who we were and what services we could provide. There was an existing external website (Link will stop working once it is depreciated) that was used as a reference and much of it contents were either used or adapted for the new sites however it was older and much of its contents needed revision. \n\nFor these sites, I was in charge of all aspects, including gathering requirements, site planning, creating content, page layout, and graphic design. I worked together with many of the other team members with expertise in each of the areas mentioned above to create sites that were both easy to use and contained relevant information that would help University of Guelph members. By the end of my term, all the sites and other aspects had been completed, pending some final content to be provided by other team members that was to be included, and the sites should be up and running soon. \n\nOutside of these sites, my duties also included creating documentation, creating new forms or reworking old ones, creating automated cloud flows, aiding other team members in their tasks, and more. \n\nAll our work was tracked using a program called Azure DevOps. It was used to create, assign, record, update, and manage work within the team. It played a critical role in the operation of our team. Early on, tasks were created for and assigned to me, but after a few weeks, I was fully trained on how to use the software, and for the remainder of my time, I was in charge of my own workflow. \n\nWe would work in two-week sprint cycles, hold stand-ups, work replenishment meetings, sprint reviews, and other such meetings to ensure that the whole team knew what was being worked on and what needed to be prioritized. Team members had roles such as project manager, product owner, etc. in accordance with the Scrum methodology.",
        "conclusion": "I hope my Work Term report has shed a light on my placement and the role I played within PMO. I am happy that this job was my first experience in a position where project work with a deadline took centre stage. It has given me a new set of skills that I can now carry forward to my last two co-op terms and beyond. In conclusion the experience and people I worked with at the PMO really made my summer a blast that went by in the blink of an eye and I am looking forward to what the future holds. \n\nThank you for taking the time to read my Summer 2023 co-op work term report.",
        "acknowledgements": "I would like to take a moment to thank my supervisor, Vinod Varughese, and the rest of the PMO team for being such an open and welcoming team. The team has been very inviting, open, and helpful since day one, and I appreciate all their combined efforts in helping me get oriented early on and ever since with the various tasks, trials, and tribulations over my time working there.",
        "cardImg": "images/Guelph_Logo_Stacked.png",
        "cardImgAlt": "Failed to Load Img",
        "articleImg1": "../images/PMO_Team.png",
        "articleImg1Alt": "The PMO Team pictured together outdoors",
        "articleImg1Desc": "Our team pictured on Deborah's (far left) farm property for an awesome team building activity day. \nFrom left to right: Deb, Jaymin, Vinod (Supervisor), Agatha, David, Alex (PMO Manager), Ben (Me), Pansy",
        "articleImg2": "../images/PMO_Logo.avif",
        "articleImg2Alt": "The PMO Team's Logo",
        "articleImg2Desc": "No Description"
    },
    {
        "articleTitle": "A",
        "slug": "B3",
        "company": "C",
        "jobTitle": "D",
        "cardSummary": "E",
        "introduction": "F",
        "aboutTheEmployer": "G",
        "goals": "H",
        "jobDesctiption": "I",
        "conclusion": "J",
        "acknowledgements": "K",
        "cardImg": "L",
        "cardImgAlt": "Failed to Load Img",
        "articleImg1": "N",
        "articleImg1Alt": "Failed to Load Img 1",
        "articleImg1Desc": "P",
        "articleImg2": "Q",
        "articleImg2Alt": "Failed to Load Img 2",
        "articleImg2Desc": "S"
    }
]